-- +migrate Up
BEGIN;

DELETE FROM holidays;

INSERT INTO holidays (order_number, date, name) VALUES
(1, '2024-7-1', 'День ветеранов боевых действий'),
(2, '2024-7-1', 'День добровольного вхождения Бурятии в состав Российского государства'),
(1, '2024-7-2', 'Международный день собак'),
(2, '2024-7-2', 'Международный день спортивного журналиста'),
(3, '2024-7-2', 'Всемирный день НЛО'),
(1, '2024-7-3', 'День ГИБДД МВД России'),
(2, '2024-7-3', 'День образования Республики Алтай'),
(3, '2024-7-3', 'День Республики Хакасия'),
(1, '2024-7-4', 'День отдыха от праздников'),
(1, '2024-7-5', 'День трудоголиков'),
(1, '2024-7-6', 'Всемирный день поцелуя'),
(2, '2024-7-6', 'Международный день Днепра'),
(3, '2024-7-6', 'Международный день кооперативов'),
(4, '2024-7-6', 'Аграфена Купальница'),
(1, '2024-7-7', 'Иван Купала'),
(2, '2024-7-7', 'День работников морского и речного флота России'),
(3, '2024-7-7', 'День образования авиалесоохраны России'),
(4, '2024-7-7', 'День победы русского флота над турецким флотом в Чесменском сражении'),
(5, '2024-7-7', 'День борьбы с психосоматическими заболеваниями'),
(6, '2024-7-7', 'Рождество Иоанна Предтечи'),
(1, '2024-7-8', 'День семьи, любви и верности в России'),
(2, '2024-7-8', 'День Зенитных ракетных войск Вооруженных Сил России'),
(3, '2024-7-8', 'Всемирный день борьбы с аллергией'),
(1, '2024-7-9', 'День сахарного печенья'),
(1, '2024-7-10', 'День победы русской армии над шведами в Полтавском сражении'),
(1, '2024-7-11', 'Всемирный день шоколада'),
(2, '2024-7-11', 'Всемирный день народонаселения'),
(3, '2024-7-11', 'День художника по свету (День светооператора или гафера)'),
(1, '2024-7-12', 'Всемирный день бортпроводника гражданской авиации'),
(2, '2024-7-12', 'Праздник славных и всехвальных первоверховных апостолов Петра и Павла'),
(3, '2024-7-12', 'День Снопа Велеса'),
(1, '2024-7-13', 'Международный день головоломки'),
(1, '2024-7-14', 'День рыбака'),
(2, '2024-7-14', 'День российской почты'),
(3, '2024-7-14', 'День действий против рыбной ловли в России'),
(4, '2024-7-14', 'День хаоса и беспорядка'),
(1, '2024-7-15', 'Всемирный день навыков молодежи'),
(1, '2024-7-16', 'Международный день змеи'),
(1, '2024-7-17', 'День этнографа в России'),
(2, '2024-7-17', 'День основания морской авиации ВМФ России'),
(3, '2024-7-17', 'Всемирный день эмоджи'),
(4, '2024-7-17', 'Всемирный день международного уголовного правосудия'),
(1, '2024-7-18', 'День создания органов государственного пожарного надзора в России'),
(2, '2024-7-18', 'Международный день Нельсона Манделы'),
(1, '2024-7-19', 'День пирожков с малиновым вареньем'),
(1, '2024-7-20', 'Международный день шахмат'),
(2, '2024-7-20', 'Международный день Луны'),
(3, '2024-7-20', 'Международный день торта'),
(1, '2024-7-21', 'Празднование в честь явления иконы Пресвятой Богородицы в Казани'),
(2, '2024-7-21', 'День металлурга'),
(3, '2024-7-21', 'День нездоровой пищи'),
(1, '2024-7-22', 'Всемирный день мозга'),
(1, '2024-7-23', 'Всемирный день китов и дельфинов'),
(2, '2024-7-23', 'День дачника в России'),
(1, '2024-7-24', 'Международный день заботы о себе'),
(2, '2024-7-24', 'День флориста в России'),
(3, '2024-7-24', 'День кадастрового инженера в России'),
(1, '2024-7-25', 'День сотрудника органов следствия Российской Федерации'),
(2, '2024-7-25', 'День речной полиции России'),
(3, '2024-7-25', 'Выборы жертвы Перуну'),
(1, '2024-7-26', 'День дяди и тети'),
(2, '2024-7-26', 'День парашютиста в России'),
(3, '2024-7-26', 'День системного администратора'),
(4, '2024-7-26', 'День эсперанто'),
(1, '2024-7-27', 'День работника торговли в России'),
(2, '2024-7-27', 'День работника МФЦ в России'),
(1, '2024-7-28', 'День Крещения Руси'),
(2, '2024-7-28', 'День Военно-Морского Флота России'),
(3, '2024-7-28', 'День PR-специалиста в России'),
(4, '2024-7-28', 'Всемирный день борьбы с гепатитом'),
(1, '2024-7-29', 'Международный день тигра'),
(1, '2024-7-30', 'Международный день дружбы'),
(2, '2024-7-30', 'Всемирный день борьбы с торговлей людьми'),
(1, '2024-7-31', 'День необычных музыкальных инструментов'),
(2, '2024-7-31', 'Всемирный день рейнджера'),
(1, '2024-8-1', 'День памяти российских воинов, погибших в Первой мировой войне'),
(2, '2024-8-1', 'День Тыла Вооруженных Сил России'),
(3, '2024-8-1', 'День образования Службы специальной связи России'),
(4, '2024-8-1', 'Всероссийский день инкассатора'),
(5, '2024-8-1', 'День борьбы с раком легкого'),
(1, '2024-8-2', 'День Воздушно-десантных войск России'),
(2, '2024-8-2', 'Международный день пива'),
(3, '2024-8-2', 'Перунов день'),
(1, '2024-8-3', 'День арбуза'),
(1, '2024-8-4', 'День железнодорожника'),
(2, '2024-8-4', 'День одиноких работающих женщин'),
(1, '2024-8-5', 'Международный день светофора'),
(1, '2024-8-6', 'День Железнодорожных войск России'),
(2, '2024-8-6', 'Всемирный день борьбы за запрещение ядерного оружия'),
(3, '2024-8-6', 'Международный день «Врачи мира за мир»'),
(1, '2024-8-7', 'День Службы специальной связи и информации Федеральной службы охраны России'),
(2, '2024-8-7', 'Международный день холостяка'),
(1, '2024-8-8', 'Всемирный день кошек'),
(2, '2024-8-8', 'Международный день альпинизма'),
(3, '2024-8-8', 'Международный день офтальмологии'),
(1, '2024-8-9', 'Всемирный день книголюбов'),
(2, '2024-8-9', 'Международный день коренных народов мира'),
(3, '2024-8-9', 'День победы русского флота под командованием Петра Первого над шведами у мыса Гангут'),
(1, '2024-8-10', 'Международный день биодизеля'),
(2, '2024-8-10', 'День физкультурника в России'),
(1, '2024-8-11', 'День белого гриба'),
(2, '2024-8-11', 'День строителя'),
(3, '2024-8-11', 'Рождество святителя Николая Чудотворца'),
(1, '2024-8-12', 'Международный день молодежи'),
(2, '2024-8-12', 'День Военно-воздушных сил России'),
(1, '2024-8-13', 'Международный день левшей'),
(1, '2024-8-14', 'Праздник происхождения (изнесения) честных древ Животворящего Креста Господня'),
(1, '2024-8-15', 'День археолога'),
(2, '2024-8-15', 'День Республики Тыва'),
(1, '2024-8-16', 'День малинового варенья'),
(1, '2024-8-17', 'День секонд-хенда'),
(2, '2024-8-17', 'Всемирный день бездомных животных'),
(1, '2024-8-18', 'День географа в России'),
(2, '2024-8-18', 'День Воздушного Флота России'),
(1, '2024-8-19', 'Всемирный день фотографии'),
(2, '2024-8-19', 'День рождения русской тельняшки'),
(3, '2024-8-19', 'День фронтовой собаки'),
(4, '2024-8-19', 'Всемирный день гуманитарной помощи'),
(5, '2024-8-19', 'Преображение Господне'),
(1, '2024-8-20', 'Всемирный день лени'),
(2, '2024-8-20', 'Всемирный день комара'),
(1, '2024-8-21', 'День офицера России'),
(2, '2024-8-21', 'Международный день памяти и поминовения жертв терроризма'),
(3, '2024-8-21', 'День Стрибога'),
(1, '2024-8-22', 'День Государственного флага Российской Федерации'),
(2, '2024-8-22', 'День Республики Коми'),
(3, '2024-8-22', 'Международный день памяти жертв актов насилия на основе религии или убеждений'),
(1, '2024-8-23', 'День разгрома советскими войсками немецко-фашистских войск в Курской битве'),
(2, '2024-8-23', 'Международный день памяти о работорговле и ее ликвидации'),
(1, '2024-8-24', 'День странной музыки'),
(2, '2024-8-24', 'Международная ночь летучих мышей'),
(1, '2024-8-25', 'День «Поцелуемся и помиримся»'),
(2, '2024-8-25', 'День шахтера'),
(1, '2024-8-26', 'День благодарности собаке'),
(1, '2024-8-27', 'День российского кино'),
(2, '2024-8-27', 'Международный день бокса'),
(1, '2024-8-28', 'День мечты'),
(2, '2024-8-28', 'Успение Пресвятой Богородицы'),
(3, '2024-8-28', 'Спожинки'),
(1, '2024-8-29', 'Международный день действий против ядерных испытаний'),
(1, '2024-8-30', 'День Республики Татарстан'),
(2, '2024-8-30', 'Международный день жертв насильственных исчезновений'),
(1, '2024-8-31', 'День блога'),
(2, '2024-8-31', 'День дальнобойщика в России'),
(3, '2024-8-31', 'День ветеринарного работника России'),
(1, '2024-9-1', 'День знаний'),
(2, '2024-9-1', 'День нефтяника'),
(3, '2024-9-1', 'День любителей сериалов'),
(4, '2024-9-1', 'День государственности Кабардино-Балкарской Республики'),
(5, '2024-9-1', 'День озера Байкал в России'),
(1, '2024-9-2', 'День российской гвардии'),
(2, '2024-9-2', 'День образования патрульно-постовой службы полиции МВД России'),
(1, '2024-9-3', 'День Победы над милитаристской Японией и окончания Второй мировой войны'),
(2, '2024-9-3', 'День солидарности в борьбе с терроризмом'),
(3, '2024-9-3', 'День прощания'),
(1, '2024-9-4', 'День специалиста по ядерному обеспечению России'),
(1, '2024-9-5', 'Международный день благотворительности'),
(1, '2024-9-6', 'День рыжих'),
(2, '2024-9-6', 'День продающего сторителлинга'),
(1, '2024-9-7', 'Международный день чистого воздуха для голубого неба'),
(2, '2024-9-7', 'Всемирный день уничтожения военной игрушки'),
(3, '2024-9-7', 'Всемирный день бороды'),
(1, '2024-9-8', 'Международный день грамотности'),
(2, '2024-9-8', 'День танкиста в России'),
(3, '2024-9-8', 'День Бородинского сражения'),
(4, '2024-9-8', 'Всемирный день журавля'),
(5, '2024-9-8', 'День Новороссийской военно-морской базы ВМФ России'),
(6, '2024-9-8', 'День финансиста в России'),
(7, '2024-9-8', 'Международный день солидарности журналистов'),
(1, '2024-9-9', 'Международный день красоты'),
(2, '2024-9-9', 'День тестировщика в России'),
(3, '2024-9-9', 'День дизайнера-графика в России'),
(1, '2024-9-10', 'Всемирный день предотвращения самоубийств'),
(1, '2024-9-11', 'Всероссийский День трезвости'),
(2, '2024-9-11', 'День специалиста органов воспитательной работы Вооруженных Сил России'),
(3, '2024-9-11', 'День подразделений по вопросам миграции системы МВД России'),
(4, '2024-9-11', 'День победы русской эскадры над турецкой эскадрой у мыса Тендра'),
(1, '2024-9-12', 'Международный день вязания крючком'),
(2, '2024-9-12', 'День программиста в России'),
(3, '2024-9-12', 'Международный день борьбы с мигренью'),
(4, '2024-9-12', 'День сотрудничества Юг-Юг Организации Объединенных Наций'),
(1, '2024-9-13', 'День парикмахера в России'),
(1, '2024-9-14', 'Церковное новолетие — начало индикта'),
(2, '2024-9-14', 'Всемирный день оказания первой помощи'),
(3, '2024-9-14', 'Новолетие, Славянский Новый год'),
(1, '2024-9-15', 'Международный день демократии'),
(2, '2024-9-15', 'День работников леса'),
(3, '2024-9-15', 'День свободных денег'),
(4, '2024-9-15', 'День федерального государственного санитарно-эпидемиологического надзора в России'),
(5, '2024-9-15', 'День единства народов Дагестана'),
(1, '2024-9-16', 'Международный день охраны озонового слоя'),
(1, '2024-9-17', 'Всемирный день безопасности пациентов'),
(1, '2024-9-18', 'Всемирный день мониторинга воды'),
(2, '2024-9-18', 'День HR-менеджера в России'),
(1, '2024-9-19', 'День оружейника в России'),
(2, '2024-9-19', 'День рождения «Смайлика»'),
(1, '2024-9-20', 'Всемирный день риса'),
(2, '2024-9-20', 'День рекрутера в России'),
(3, '2024-9-20', 'День секретаря в России'),
(4, '2024-9-20', 'День Mini MBA'),
(1, '2024-9-21', 'Международный день мира'),
(2, '2024-9-21', 'Международный день хирурга'),
(3, '2024-9-21', 'Всемирный день русского единения'),
(4, '2024-9-21', 'Всемирный день донора костного мозга'),
(5, '2024-9-21', 'День победы русских полков в Куликовской битве'),
(6, '2024-9-21', 'Рождество Пресвятой Богородицы'),
(7, '2024-9-21', 'День Рода и Рожениц'),
(8, '2024-9-21', 'Международный день распространения информации о болезни Альцгеймера'),
(9, '2024-9-21', 'День нулевой эмиссии'),
(1, '2024-9-22', 'Всемирный день без автомобиля'),
(2, '2024-9-22', 'День осеннего равноденствия'),
(3, '2024-9-22', 'Всемирный день защиты слонов'),
(4, '2024-9-22', 'Всемирный день носорога'),
(5, '2024-9-22', 'День Хоббита'),
(6, '2024-9-22', 'Праздник Лады'),
(1, '2024-9-23', 'Международный день жестовых языков'),
(1, '2024-9-24', 'Международный день караванщика'),
(2, '2024-9-24', 'День Государственного герба и Государственного флага Республики Крым'),
(1, '2024-9-25', 'Всемирный день фармацевта'),
(1, '2024-9-26', 'День встречи со старыми друзьями'),
(2, '2024-9-26', 'Всемирный день моря'),
(3, '2024-9-26', 'Европейский день языков'),
(4, '2024-9-26', 'Международный день борьбы за полную ликвидацию ядерного оружия'),
(5, '2024-9-26', 'Всемирный день контрацепции'),
(6, '2024-9-26', 'Всемирный день бестраншейных технологий'),
(1, '2024-9-27', 'Всемирный день туризма'),
(2, '2024-9-27', 'День воспитателя и всех дошкольных работников в России'),
(3, '2024-9-27', 'День Государственности Республики Саха (Якутия)'),
(4, '2024-9-27', 'Праздник Воздвижения Креста Господня'),
(5, '2024-9-27', 'Закрытие Сварги (Вырий)'),
(1, '2024-9-28', 'Международный день всеобщего доступа к информации'),
(2, '2024-9-28', 'День работника атомной промышленности в России'),
(3, '2024-9-28', 'День Деловой книги в России'),
(4, '2024-9-28', 'День генерального директора в России'),
(5, '2024-9-28', 'Всемирный день борьбы против бешенства'),
(1, '2024-9-29', 'День машиностроителя'),
(2, '2024-9-29', 'Всемирный день сердца'),
(3, '2024-9-29', 'День отоларинголога'),
(4, '2024-9-29', 'Международный день глухих'),
(5, '2024-9-29', 'Международный день распространения информации о продовольственных потерях и пищевых отходах'),
(6, '2024-9-29', 'День тигра на Дальнем Востоке'),
(1, '2024-9-30', 'День воссоединения Донецкой Народной Республики, Луганской Народной Республики, Запорожской области и Херсонской области с Российской Федерацией'),
(2, '2024-9-30', 'День интернета в России'),
(3, '2024-9-30', 'День Сил Специального Назначения Росгвардии'),
(4, '2024-9-30', 'Международный день перевода'),
(5, '2024-9-30', 'День уютного вязаного пледа'),
(1, '2024-10-1', 'Международный день пожилых людей'),
(2, '2024-10-1', 'Международный день музыки'),
(3, '2024-10-1', 'Всемирный день вегетарианства'),
(4, '2024-10-1', 'День Сухопутных войск России'),
(1, '2024-10-2', 'Международный день социального педагога'),
(2, '2024-10-2', 'Международный день ненасилия'),
(3, '2024-10-2', 'День метростроителя в России'),
(4, '2024-10-2', 'День среднего профессионального образования в России'),
(1, '2024-10-3', 'Всемирный день трезвости и борьбы с алкоголизмом'),
(2, '2024-10-3', 'День ОМОН в России'),
(1, '2024-10-4', 'Всемирный день животных'),
(2, '2024-10-4', 'Всемирный день улыбки'),
(3, '2024-10-4', 'День Космических войск России'),
(4, '2024-10-4', 'День гражданской обороны России'),
(5, '2024-10-4', 'День Сварога'),
(1, '2024-10-5', 'Всемирный день учителя'),
(2, '2024-10-5', 'День работников уголовного розыска России'),
(3, '2024-10-5', 'День образования Республики Адыгея'),
(1, '2024-10-6', 'Всемирный день охраны мест обитаний'),
(2, '2024-10-6', 'День российского страховщика'),
(1, '2024-10-7', 'Международный день врача'),
(2, '2024-10-7', 'День образования штабных подразделений МВД России'),
(3, '2024-10-7', 'Всемирный день архитектуры'),
(4, '2024-10-7', 'Всемирный день Хабитат'),
(5, '2024-10-7', 'Родогощ (Таусень)'),
(1, '2024-10-8', 'День командира надводного, подводного и воздушного корабля ВМФ России'),
(1, '2024-10-9', 'Всемирный день почты'),
(2, '2024-10-9', 'День разгрома советскими войсками немецко-фашистских войск в битве за Кавказ'),
(3, '2024-10-9', 'День Специальной пожарной охраны МЧС России'),
(1, '2024-10-10', 'Всемирный день психического здоровья'),
(2, '2024-10-10', 'Всемирный день зрения'),
(3, '2024-10-10', 'Всемирный день борьбы со смертной казнью'),
(4, '2024-10-10', 'Международный день каши'),
(1, '2024-10-11', 'Международный день девочек'),
(2, '2024-10-11', 'Всемирный день яйца'),
(3, '2024-10-11', 'Всемирный день против боли'),
(4, '2024-10-11', 'День Республики Башкортостан'),
(1, '2024-10-12', 'Всемирный день борьбы с артритом'),
(2, '2024-10-12', 'День кадрового работника в России'),
(1, '2024-10-13', 'Международный день по снижению риска бедствий'),
(2, '2024-10-13', 'День работника сельского хозяйства и перерабатывающей промышленности в России'),
(3, '2024-10-13', 'День инфобизнесмена'),
(1, '2024-10-14', 'Покров Пресвятой Богородицы'),
(2, '2024-10-14', 'Всемирный день стандартов'),
(3, '2024-10-14', 'День работников заповедного дела в России'),
(4, '2024-10-14', 'Покров у славян'),
(1, '2024-10-15', 'День создания адресно-справочной службы Российского государства'),
(2, '2024-10-15', 'Международный день Белой трости'),
(3, '2024-10-15', 'Всемирный день мытья рук'),
(4, '2024-10-15', 'Международный день сельских женщин'),
(1, '2024-10-16', 'Всемирный день хлеба'),
(2, '2024-10-16', 'Всемирный день продовольствия'),
(3, '2024-10-16', 'День нетворкинга (День расширения деловых связей)'),
(4, '2024-10-16', 'День Шефа (День Босса)'),
(5, '2024-10-16', 'День аллерголога'),
(6, '2024-10-16', 'Всемирный день анестезии (День анестезиолога-реаниматолога)'),
(1, '2024-10-17', 'День участкового терапевта'),
(2, '2024-10-17', 'Международный день кредитных союзов'),
(3, '2024-10-17', 'Международный день борьбы за ликвидацию нищеты'),
(1, '2024-10-18', 'День галстука'),
(2, '2024-10-18', 'Всемирный день конфет'),
(1, '2024-10-19', 'Всероссийский день лицеиста'),
(2, '2024-10-19', 'День написания писем в будущее'),
(1, '2024-10-20', 'Международный день поваров'),
(2, '2024-10-20', 'День отца в России'),
(3, '2024-10-20', 'Международный день авиадиспетчера'),
(4, '2024-10-20', 'День работников дорожного хозяйства в России'),
(5, '2024-10-20', 'Международный день ленивца'),
(6, '2024-10-20', 'День работников пищевой промышленности России'),
(7, '2024-10-20', 'Всемирный день борьбы с остеопорозом'),
(8, '2024-10-20', 'День образования Приморского края'),
(9, '2024-10-20', 'День военного связиста в России'),
(1, '2024-10-22', 'Международный день заикающихся людей'),
(2, '2024-10-22', 'День финансово-экономической службы Вооруженных Сил РФ'),
(1, '2024-10-23', 'Международный день снежного барса'),
(2, '2024-10-23', 'День работников рекламы в России'),
(3, '2024-10-23', 'День осведомленности о синдроме Кабуки'),
(1, '2024-10-24', 'День ООН'),
(2, '2024-10-24', 'Всемирный день информации о развитии'),
(3, '2024-10-24', 'Российский День без бумаги'),
(4, '2024-10-24', 'Всемирный день борьбы с полиомиелитом'),
(5, '2024-10-24', 'День подразделений специального назначения Вооруженных Сил России'),
(1, '2024-10-25', 'День маркетолога'),
(2, '2024-10-25', 'День таможенника Российской Федерации'),
(3, '2024-10-25', 'День работника кабельной промышленности в России'),
(1, '2024-10-26', 'День приятных неожиданностей'),
(2, '2024-10-26', 'Всероссийский день гимнастики'),
(1, '2024-10-27', 'День плюшевого мишки'),
(2, '2024-10-27', 'День автомобилиста в России'),
(3, '2024-10-27', 'Всемирный день аудиовизуального наследия'),
(4, '2024-10-27', 'Международный день тёщи'),
(1, '2024-10-28', 'Международный день анимации'),
(2, '2024-10-28', 'День бабушек и дедушек в России'),
(3, '2024-10-28', 'Международный день школьных библиотек'),
(4, '2024-10-28', 'День создания армейской авиации России'),
(1, '2024-10-29', 'День вневедомственной охраны Росгвардии'),
(2, '2024-10-29', 'Всемирный день борьбы с инсультом'),
(3, '2024-10-29', 'Всемирный день борьбы с псориазом'),
(1, '2024-10-30', 'День основания Российского военно-морского флота'),
(2, '2024-10-30', 'День инженера-механика в России'),
(3, '2024-10-30', 'День тренера в России'),
(1, '2024-10-31', 'Международный день Черного моря'),
(2, '2024-10-31', 'Всемирный день городов'),
(3, '2024-10-31', 'Международный день экономии'),
(4, '2024-10-31', 'День сурдопереводчика в России'),
(5, '2024-10-31', 'День работников следственных изоляторов и тюрем в России'),
(6, '2024-10-31', 'Тыквенный спас'),
(7, '2024-10-31', 'Хэллоуин'),
(1, '2024-11-1', 'День гадания на кофейной гуще'),
(2, '2024-11-1', 'Международный день вегана'),
(3, '2024-11-1', 'День судебного пристава в России'),
(1, '2024-11-2', 'Всемирный день мужчин'),
(2, '2024-11-2', 'Международный день прекращения безнаказанности за преступления против журналистов'),
(1, '2024-11-4', 'День народного единства России'),
(1, '2024-11-5', 'День военного разведчика в России'),
(2, '2024-11-5', 'Всемирный день распространения информации о проблеме цунами'),
(1, '2024-11-6', 'Международный день предотвращения эксплуатации окружающей среды во время войны и вооруженных конфликтов'),
(2, '2024-11-6', 'Международный день памяти животных, погибших от рук человека'),
(3, '2024-11-6', 'День осведомленности о стрессе'),
(1, '2024-11-7', 'День проведения военного парада на Красной площади в Москве в 1941 году'),
(2, '2024-11-7', 'День Октябрьской революции 1917 года в России'),
(1, '2024-11-8', 'День Сибири'),
(2, '2024-11-8', 'День пианиста'),
(3, '2024-11-8', 'Всемирный день без Wi-Fi'),
(4, '2024-11-8', 'Международный день радиологии'),
(5, '2024-11-8', 'Международный день КВН'),
(1, '2024-11-9', 'Международный день против фашизма, расизма и антисемитизма'),
(2, '2024-11-9', 'Всемирный день лизинга'),
(3, '2024-11-9', 'Международный день антиядерных акций'),
(1, '2024-11-10', 'День сотрудника органов внутренних дел Российской Федерации'),
(2, '2024-11-10', 'Всемирный день науки за мир и развитие'),
(3, '2024-11-10', 'Всемирный день молодежи'),
(4, '2024-11-10', 'Международный день бухгалтерии (День бухгалтера)'),
(5, '2024-11-10', 'День кухонной мойки'),
(6, '2024-11-10', 'День богини Макоши'),
(1, '2024-11-11', 'День экономиста в России'),
(2, '2024-11-11', 'День военного пенсионера в России'),
(3, '2024-11-11', 'День работника восстановительного поезда в России'),
(4, '2024-11-11', 'Всемирный день шопинга'),
(5, '2024-11-11', 'Международный день энергосбережения'),
(1, '2024-11-12', 'Синичкин день'),
(2, '2024-11-12', 'День работников Сбербанка России'),
(3, '2024-11-12', 'День специалиста по безопасности в России'),
(4, '2024-11-12', 'Всемирный день борьбы с пневмонией'),
(1, '2024-11-13', 'Всемирный день доброты'),
(2, '2024-11-13', 'Международный день слепых'),
(3, '2024-11-13', 'День войск радиационной, химической и биологической защиты России'),
(4, '2024-11-13', 'День службы защиты государственной тайны Вооруженных сил России'),
(1, '2024-11-14', 'Всемирный день борьбы с диабетом'),
(2, '2024-11-14', 'Всемирный день качества'),
(3, '2024-11-14', 'Международный день логопеда'),
(4, '2024-11-14', 'Всемирный день юзабилити'),
(5, '2024-11-14', 'День социолога в России'),
(1, '2024-11-15', 'Всероссийский день призывника'),
(2, '2024-11-15', 'День создания подразделений по борьбе с организованной преступностью в России'),
(3, '2024-11-15', 'День вторичной переработки'),
(1, '2024-11-16', 'Международный день, посвященный терпимости'),
(2, '2024-11-16', 'Международный день борьбы с анорексией'),
(3, '2024-11-16', 'Всероссийский день проектировщика'),
(1, '2024-11-17', 'Международный день студентов'),
(2, '2024-11-17', 'Международный день недоношенных детей'),
(3, '2024-11-17', 'День участковых уполномоченных полиции в России'),
(1, '2024-11-18', 'День рождения Деда Мороза'),
(1, '2024-11-19', 'Международный мужской день'),
(2, '2024-11-19', 'День ракетных войск и артиллерии в России'),
(3, '2024-11-19', 'День преподавателя высшей школы в России'),
(4, '2024-11-19', 'День работника стекольной промышленности России'),
(5, '2024-11-19', 'День женского предпринимательства'),
(6, '2024-11-19', 'Всемирный день туалета'),
(1, '2024-11-20', 'Всемирный день ребенка'),
(2, '2024-11-20', 'День педиатра'),
(3, '2024-11-20', 'День работника транспорта в России'),
(4, '2024-11-20', 'День географических информационных систем (День ГИС)'),
(5, '2024-11-20', 'День индустриализации Африки'),
(1, '2024-11-21', 'Всемирный день приветствий'),
(2, '2024-11-21', 'Всемирный день телевидения'),
(3, '2024-11-21', 'Всемирный день философии'),
(4, '2024-11-21', 'День Военной присяги в России'),
(5, '2024-11-21', 'День работника налоговых органов Российской Федерации'),
(6, '2024-11-21', 'День отказа от курения'),
(7, '2024-11-21', 'День бухгалтера в России'),
(1, '2024-11-22', 'День сыновей'),
(2, '2024-11-22', 'День психолога в России'),
(1, '2024-11-23', 'Международный день акварели'),
(1, '2024-11-24', 'День матери в России'),
(2, '2024-11-24', 'День работника свеклосахарной отрасли России'),
(3, '2024-11-24', 'День моржа в России'),
(1, '2024-11-25', 'День российского военного миротворца'),
(2, '2024-11-25', 'День гармониста в России'),
(3, '2024-11-25', 'Международный день борьбы за ликвидацию насилия в отношении женщин'),
(1, '2024-11-26', 'Всемирный день информации'),
(2, '2024-11-26', 'Международный день сапожника'),
(1, '2024-11-27', 'День морской пехоты России'),
(2, '2024-11-27', 'День самозанятых в России'),
(3, '2024-11-27', 'День оценщика в России'),
(1, '2024-11-28', 'Всемирный день сострадания'),
(1, '2024-11-29', 'Черная пятница'),
(2, '2024-11-29', 'Международный день солидарности с палестинским народом'),
(3, '2024-11-29', 'Всемирный день отказа от покупок'),
(1, '2024-11-30', 'Всемирный день домашних животных'),
(2, '2024-11-30', 'Международный день защиты информации'),
(3, '2024-11-30', 'День памяти всех жертв применения химического оружия'),
(1, '2024-12-1', 'Всемирный день борьбы со СПИДом'),
(2, '2024-12-1', 'Всероссийский день хоккея'),
(3, '2024-12-1', 'День Пермского края'),
(4, '2024-12-1', 'День победы русской эскадры над турецкой эскадрой у мыса Синоп'),
(5, '2024-12-1', 'День сетевика в России'),
(6, '2024-12-1', 'День невролога'),
(1, '2024-12-2', 'День банковского работника России'),
(2, '2024-12-2', 'День 2D-художников'),
(3, '2024-12-2', 'Киберпонедельник'),
(4, '2024-12-2', 'Международный день борьбы за отмену рабства'),
(1, '2024-12-3', 'Международный день инвалидов'),
(2, '2024-12-3', 'День Неизвестного Солдата в России'),
(3, '2024-12-3', 'День юриста в России'),
(4, '2024-12-3', 'Всемирный день компьютерной графики'),
(5, '2024-12-3', 'Международный день борьбы с пестицидами'),
(1, '2024-12-4', 'День заказов подарков и написания писем Деду Морозу'),
(2, '2024-12-4', 'Праздник Введения во храм Пресвятой Богородицы'),
(3, '2024-12-4', 'Международный день банков'),
(4, '2024-12-4', 'День информатики в России'),
(5, '2024-12-4', 'День Марены'),
(1, '2024-12-5', 'День онлайн-предпринимателя'),
(2, '2024-12-5', 'День начала контрнаступления советских войск под Москвой'),
(3, '2024-12-5', 'День добровольца (волонтера) в России'),
(4, '2024-12-5', 'Международный день добровольцев'),
(5, '2024-12-5', 'Всемирный день почв'),
(6, '2024-12-5', 'День ниндзя'),
(1, '2024-12-6', 'День образования подразделений по контролю за оборотом наркотиков системы МВД России'),
(2, '2024-12-6', 'День памяти великого князя Александра Невского'),
(1, '2024-12-7', 'Международный день гражданской авиации'),
(2, '2024-12-7', 'День инженерно-авиационной службы ВКС России'),
(1, '2024-12-8', 'Международный день художника'),
(2, '2024-12-8', 'День образования российского казначейства'),
(1, '2024-12-9', 'День Героев Отечества в России'),
(2, '2024-12-9', 'День создания ведомственной охраны железнодорожного транспорта России'),
(3, '2024-12-9', 'Международный день борьбы с коррупцией'),
(4, '2024-12-9', 'Международный день памяти жертв преступления геноцида, чествования их достоинства и предупреждения этого преступления'),
(1, '2024-12-10', 'День прав человека'),
(2, '2024-12-10', 'Международный день прав животных'),
(3, '2024-12-10', 'День создания службы связи МВД России'),
(1, '2024-12-11', 'Международный день гор'),
(2, '2024-12-11', 'Международный день танго'),
(1, '2024-12-12', 'День Конституции Российской Федерации'),
(2, '2024-12-12', 'День пряничного домика'),
(3, '2024-12-12', 'Международный день всеобщего охвата услугами здравоохранения'),
(4, '2024-12-12', 'Международный день нейтралитета'),
(1, '2024-12-13', 'День медведя'),
(2, '2024-12-13', 'День святого апостола Андрея Первозванного'),
(1, '2024-12-14', 'День башкирского языка'),
(2, '2024-12-14', 'Наумов день'),
(3, '2024-12-14', 'Международный день обезьян'),
(1, '2024-12-15', 'День чая'),
(2, '2024-12-15', 'День образования Радиотехнических войск ВКС России'),
(1, '2024-12-16', 'День покорения вершин'),
(1, '2024-12-17', 'День Ракетных войск стратегического назначения Вооруженных Сил России'),
(2, '2024-12-17', 'День образования Российской фельдъегерской связи'),
(3, '2024-12-17', 'День курьера в России'),
(4, '2024-12-17', 'Международный день защиты секс-работников от насилия и жестокости'),
(1, '2024-12-18', 'Международный день мигранта'),
(2, '2024-12-18', 'День подразделений собственной безопасности органов внутренних дел России'),
(3, '2024-12-18', 'День работников органов ЗАГСа в России'),
(4, '2024-12-18', 'День арабского языка в ООН'),
(1, '2024-12-19', 'День военной контрразведки в России'),
(2, '2024-12-19', 'День снабженца в России'),
(3, '2024-12-19', 'Международный день помощи бедным'),
(1, '2024-12-20', 'День работника органов безопасности Российской Федерации'),
(2, '2024-12-20', 'Международный день солидарности людей'),
(3, '2024-12-20', 'День неудачника'),
(1, '2024-12-21', 'Всемирный день баскетбола'),
(2, '2024-12-21', 'День зимнего солнцестояния'),
(3, '2024-12-21', 'День риэлтора в России'),
(4, '2024-12-21', 'Карачун (Корочун)'),
(1, '2024-12-22', 'День энергетика'),
(2, '2024-12-22', 'Международный день бардовской песни'),
(3, '2024-12-22', 'День Гидрометеорологической службы Вооружённых сил России'),
(4, '2024-12-22', 'День образования Пенсионного фонда России'),
(1, '2024-12-23', 'День дальней авиации ВКС России'),
(1, '2024-12-24', 'День взятия турецкой крепости Измаил русскими войсками'),
(1, '2024-12-25', 'Рождество по Новоюлианскому календарю'),
(2, '2024-12-25', 'Коляда'),
(1, '2024-12-26', 'День подарков'),
(2, '2024-12-26', 'День войск ПВО Сухопутных войск России'),
(1, '2024-12-27', 'День спасателя Российской Федерации'),
(2, '2024-12-27', 'Международный день противоэпидемической готовности'),
(1, '2024-12-28', 'Международный день кино'),
(1, '2024-12-29', 'Международный день виолончели'),
(1, '2024-12-30', 'День страны, которой нет');

INSERT INTO holiday_categories (name)
VALUES ('Международные праздники')
ON CONFLICT (name) DO NOTHING;

INSERT INTO holiday_categories (name)
VALUES ('Праздники России')
ON CONFLICT (name) DO NOTHING;

INSERT INTO holiday_categories (name)
VALUES ('Праздники славян')
ON CONFLICT (name) DO NOTHING;

INSERT INTO holiday_categories (name)
VALUES ('Праздники ООН')
ON CONFLICT (name) DO NOTHING;

INSERT INTO holiday_categories (name)
VALUES ('Православные праздники')
ON CONFLICT (name) DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День ветеранов боевых действий'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День добровольного вхождения Бурятии в состав Российского государства'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день собак'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день спортивного журналиста'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Всемирный день НЛО'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День ГИБДД МВД России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День образования Республики Алтай'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День Республики Хакасия'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День отдыха от праздников'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День трудоголиков'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день поцелуя'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день Днепра'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Международный день кооперативов'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Аграфена Купальница'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники славян'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Иван Купала'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники славян'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Иван Купала'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Иван Купала'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День работников морского и речного флота России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День образования авиалесоохраны России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'День победы русского флота над турецким флотом в Чесменском сражении'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'День борьбы с психосоматическими заболеваниями'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 6 AND name = 'Рождество Иоанна Предтечи'), 
       (SELECT id FROM holiday_categories WHERE name = 'Православные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День семьи, любви и верности в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День Зенитных ракетных войск Вооруженных Сил России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Всемирный день борьбы с аллергией'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День сахарного печенья'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День победы русской армии над шведами в Полтавском сражении'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день шоколада'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Всемирный день народонаселения'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День художника по свету (День светооператора или гафера)'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день бортпроводника гражданской авиации'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Праздник славных и всехвальных первоверховных апостолов Петра и Павла'), 
       (SELECT id FROM holiday_categories WHERE name = 'Православные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День Снопа Велеса'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники славян'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день головоломки'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День рыбака'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День рыбака'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День российской почты'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День действий против рыбной ловли в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'День хаоса и беспорядка'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день навыков молодежи'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день змеи'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День этнографа в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День основания морской авиации ВМФ России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Всемирный день эмоджи'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Всемирный день международного уголовного правосудия'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День создания органов государственного пожарного надзора в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день Нельсона Манделы'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День пирожков с малиновым вареньем'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день шахмат'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день Луны'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Международный день торта'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Празднование в честь явления иконы Пресвятой Богородицы в Казани'), 
       (SELECT id FROM holiday_categories WHERE name = 'Православные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День металлурга'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День металлурга'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День нездоровой пищи'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день мозга'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день китов и дельфинов'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День дачника в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день заботы о себе'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День флориста в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День кадастрового инженера в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День сотрудника органов следствия Российской Федерации'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День речной полиции России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Выборы жертвы Перуну'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники славян'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День дяди и тети'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День парашютиста в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День системного администратора'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День системного администратора'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'День эсперанто'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День работника торговли в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День работника МФЦ в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День Крещения Руси'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День Военно-Морского Флота России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День PR-специалиста в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Всемирный день борьбы с гепатитом'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день тигра'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день дружбы'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Всемирный день борьбы с торговлей людьми'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День необычных музыкальных инструментов'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Всемирный день рейнджера'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День памяти российских воинов, погибших в Первой мировой войне'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День Тыла Вооруженных Сил России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День образования Службы специальной связи России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Всероссийский день инкассатора'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'День борьбы с раком легкого'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День Воздушно-десантных войск России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день пива'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Перунов день'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники славян'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День арбуза'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День железнодорожника'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День железнодорожника'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День одиноких работающих женщин'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день светофора'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День Железнодорожных войск России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Всемирный день борьбы за запрещение ядерного оружия'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Международный день «Врачи мира за мир»'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День Службы специальной связи и информации Федеральной службы охраны России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день холостяка'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день кошек'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день альпинизма'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Международный день офтальмологии'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день книголюбов'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день коренных народов мира'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День победы русского флота под командованием Петра Первого над шведами у мыса Гангут'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день биодизеля'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День физкультурника в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День белого гриба'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День строителя'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День строителя'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Рождество святителя Николая Чудотворца'), 
       (SELECT id FROM holiday_categories WHERE name = 'Православные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день молодежи'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День Военно-воздушных сил России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день левшей'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Праздник происхождения (изнесения) честных древ Животворящего Креста Господня'), 
       (SELECT id FROM holiday_categories WHERE name = 'Православные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День археолога'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День Республики Тыва'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День малинового варенья'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День секонд-хенда'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Всемирный день бездомных животных'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День географа в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День Воздушного Флота России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день фотографии'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День рождения русской тельняшки'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День фронтовой собаки'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Всемирный день гуманитарной помощи'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'Преображение Господне'), 
       (SELECT id FROM holiday_categories WHERE name = 'Православные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день лени'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Всемирный день комара'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День офицера России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день памяти и поминовения жертв терроризма'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День Стрибога'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники славян'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День Государственного флага Российской Федерации'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День Республики Коми'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Международный день памяти жертв актов насилия на основе религии или убеждений'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День разгрома советскими войсками немецко-фашистских войск в Курской битве'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день памяти о работорговле и ее ликвидации'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День странной музыки'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международная ночь летучих мышей'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День «Поцелуемся и помиримся»'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День шахтера'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День шахтера'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День благодарности собаке'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День российского кино'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день бокса'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День мечты'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Успение Пресвятой Богородицы'), 
       (SELECT id FROM holiday_categories WHERE name = 'Православные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Спожинки'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники славян'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день действий против ядерных испытаний'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День Республики Татарстан'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день жертв насильственных исчезновений'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День блога'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День дальнобойщика в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День ветеринарного работника России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День знаний'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День знаний'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День нефтяника'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День нефтяника'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День любителей сериалов'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'День государственности Кабардино-Балкарской Республики'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'День озера Байкал в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День российской гвардии'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День образования патрульно-постовой службы полиции МВД России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День Победы над милитаристской Японией и окончания Второй мировой войны'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День солидарности в борьбе с терроризмом'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День прощания'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День специалиста по ядерному обеспечению России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день благотворительности'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День рыжих'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День продающего сторителлинга'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день чистого воздуха для голубого неба'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Всемирный день уничтожения военной игрушки'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Всемирный день бороды'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день грамотности'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День танкиста в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День Бородинского сражения'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Всемирный день журавля'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'День Новороссийской военно-морской базы ВМФ России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 6 AND name = 'День финансиста в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 7 AND name = 'Международный день солидарности журналистов'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день красоты'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День тестировщика в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День дизайнера-графика в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день предотвращения самоубийств'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всероссийский День трезвости'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День специалиста органов воспитательной работы Вооруженных Сил России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День подразделений по вопросам миграции системы МВД России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'День победы русской эскадры над турецкой эскадрой у мыса Тендра'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день вязания крючком'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День программиста в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Международный день борьбы с мигренью'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'День сотрудничества Юг-Юг Организации Объединенных Наций'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День парикмахера в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Церковное новолетие — начало индикта'), 
       (SELECT id FROM holiday_categories WHERE name = 'Православные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Всемирный день оказания первой помощи'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Новолетие, Славянский Новый год'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники славян'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день демократии'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День работников леса'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День работников леса'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День свободных денег'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'День федерального государственного санитарно-эпидемиологического надзора в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'День единства народов Дагестана'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день охраны озонового слоя'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день безопасности пациентов'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день мониторинга воды'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День HR-менеджера в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День оружейника в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День рождения «Смайлика»'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день риса'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День рекрутера в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День секретаря в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'День Mini MBA'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день мира'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день хирурга'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Всемирный день русского единения'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Всемирный день донора костного мозга'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'День победы русских полков в Куликовской битве'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 6 AND name = 'Рождество Пресвятой Богородицы'), 
       (SELECT id FROM holiday_categories WHERE name = 'Православные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 7 AND name = 'День Рода и Рожениц'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники славян'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 8 AND name = 'Международный день распространения информации о болезни Альцгеймера'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 9 AND name = 'День нулевой эмиссии'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день без автомобиля'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День осеннего равноденствия'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Всемирный день защиты слонов'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Всемирный день носорога'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'День Хоббита'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 6 AND name = 'Праздник Лады'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники славян'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день жестовых языков'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день караванщика'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День Государственного герба и Государственного флага Республики Крым'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день фармацевта'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День встречи со старыми друзьями'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Всемирный день моря'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Европейский день языков'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Международный день борьбы за полную ликвидацию ядерного оружия'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'Всемирный день контрацепции'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 6 AND name = 'Всемирный день бестраншейных технологий'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день туризма'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День воспитателя и всех дошкольных работников в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День Государственности Республики Саха (Якутия)'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Праздник Воздвижения Креста Господня'), 
       (SELECT id FROM holiday_categories WHERE name = 'Православные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'Закрытие Сварги (Вырий)'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники славян'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день всеобщего доступа к информации'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День работника атомной промышленности в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День Деловой книги в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'День генерального директора в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'Всемирный день борьбы против бешенства'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День машиностроителя'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День машиностроителя'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Всемирный день сердца'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День отоларинголога'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Международный день глухих'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'Международный день распространения информации о продовольственных потерях и пищевых отходах'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 6 AND name = 'День тигра на Дальнем Востоке'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День воссоединения Донецкой Народной Республики, Луганской Народной Республики, Запорожской области и Херсонской области с Российской Федерацией'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День интернета в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День Сил Специального Назначения Росгвардии'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Международный день перевода'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'День уютного вязаного пледа'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день пожилых людей'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день пожилых людей'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день музыки'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Всемирный день вегетарианства'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'День Сухопутных войск России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день социального педагога'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день ненасилия'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День метростроителя в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'День среднего профессионального образования в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день трезвости и борьбы с алкоголизмом'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День ОМОН в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день животных'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Всемирный день улыбки'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День Космических войск России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'День гражданской обороны России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'День Сварога'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники славян'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день учителя'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день учителя'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День работников уголовного розыска России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День образования Республики Адыгея'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день охраны мест обитаний'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День российского страховщика'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день врача'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День образования штабных подразделений МВД России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Всемирный день архитектуры'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Всемирный день Хабитат'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'Родогощ (Таусень)'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники славян'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День командира надводного, подводного и воздушного корабля ВМФ России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день почты'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День разгрома советскими войсками немецко-фашистских войск в битве за Кавказ'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День Специальной пожарной охраны МЧС России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день психического здоровья'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Всемирный день зрения'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Всемирный день борьбы со смертной казнью'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Международный день каши'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день девочек'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Всемирный день яйца'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Всемирный день против боли'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'День Республики Башкортостан'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день борьбы с артритом'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День кадрового работника в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день по снижению риска бедствий'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День работника сельского хозяйства и перерабатывающей промышленности в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День инфобизнесмена'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Покров Пресвятой Богородицы'), 
       (SELECT id FROM holiday_categories WHERE name = 'Православные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Всемирный день стандартов'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День работников заповедного дела в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Покров у славян'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники славян'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День создания адресно-справочной службы Российского государства'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день Белой трости'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Всемирный день мытья рук'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Международный день сельских женщин'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день хлеба'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Всемирный день продовольствия'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День нетворкинга (День расширения деловых связей)'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'День Шефа (День Босса)'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'День аллерголога'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 6 AND name = 'Всемирный день анестезии (День анестезиолога-реаниматолога)'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День участкового терапевта'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день кредитных союзов'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Международный день борьбы за ликвидацию нищеты'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День галстука'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Всемирный день конфет'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всероссийский день лицеиста'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День написания писем в будущее'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день поваров'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День отца в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Международный день авиадиспетчера'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'День работников дорожного хозяйства в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'Международный день ленивца'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 6 AND name = 'День работников пищевой промышленности России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 7 AND name = 'Всемирный день борьбы с остеопорозом'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 8 AND name = 'День образования Приморского края'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 9 AND name = 'День военного связиста в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день заикающихся людей'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День финансово-экономической службы Вооруженных Сил РФ'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день снежного барса'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День работников рекламы в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День осведомленности о синдроме Кабуки'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День ООН'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Всемирный день информации о развитии'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Российский День без бумаги'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Всемирный день борьбы с полиомиелитом'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'День подразделений специального назначения Вооруженных Сил России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День маркетолога'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День таможенника Российской Федерации'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День работника кабельной промышленности в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День приятных неожиданностей'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Всероссийский день гимнастики'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День плюшевого мишки'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День автомобилиста в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Всемирный день аудиовизуального наследия'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Международный день тёщи'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день анимации'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День бабушек и дедушек в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Международный день школьных библиотек'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'День создания армейской авиации России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День вневедомственной охраны Росгвардии'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Всемирный день борьбы с инсультом'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Всемирный день борьбы с псориазом'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День основания Российского военно-морского флота'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День инженера-механика в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День тренера в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день Черного моря'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Всемирный день городов'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Международный день экономии'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'День сурдопереводчика в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'День работников следственных изоляторов и тюрем в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 6 AND name = 'Тыквенный спас'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 7 AND name = 'Хэллоуин'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День гадания на кофейной гуще'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день вегана'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День судебного пристава в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день мужчин'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день прекращения безнаказанности за преступления против журналистов'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День народного единства России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День военного разведчика в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Всемирный день распространения информации о проблеме цунами'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день предотвращения эксплуатации окружающей среды во время войны и вооруженных конфликтов'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день памяти животных, погибших от рук человека'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День осведомленности о стрессе'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День проведения военного парада на Красной площади в Москве в 1941 году'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День Октябрьской революции 1917 года в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День Сибири'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День пианиста'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Всемирный день без Wi-Fi'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Международный день радиологии'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'Международный день КВН'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день против фашизма, расизма и антисемитизма'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Всемирный день лизинга'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Международный день антиядерных акций'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День сотрудника органов внутренних дел Российской Федерации'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Всемирный день науки за мир и развитие'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Всемирный день молодежи'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Международный день бухгалтерии (День бухгалтера)'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'День кухонной мойки'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 6 AND name = 'День богини Макоши'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники славян'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День экономиста в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День военного пенсионера в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День работника восстановительного поезда в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Всемирный день шопинга'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'Международный день энергосбережения'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Синичкин день'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День работников Сбербанка России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День специалиста по безопасности в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Всемирный день борьбы с пневмонией'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день доброты'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день слепых'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День войск радиационной, химической и биологической защиты России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'День службы защиты государственной тайны Вооруженных сил России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день борьбы с диабетом'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Всемирный день качества'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Международный день логопеда'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Всемирный день юзабилити'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'День социолога в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всероссийский день призывника'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День создания подразделений по борьбе с организованной преступностью в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День вторичной переработки'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день, посвященный терпимости'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день борьбы с анорексией'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Всероссийский день проектировщика'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день студентов'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день недоношенных детей'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День участковых уполномоченных полиции в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День рождения Деда Мороза'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный мужской день'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День ракетных войск и артиллерии в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День преподавателя высшей школы в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'День работника стекольной промышленности России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'День женского предпринимательства'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 6 AND name = 'Всемирный день туалета'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день ребенка'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День педиатра'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День работника транспорта в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'День географических информационных систем (День ГИС)'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'День индустриализации Африки'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день приветствий'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Всемирный день телевидения'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Всемирный день философии'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'День Военной присяги в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'День работника налоговых органов Российской Федерации'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 6 AND name = 'День отказа от курения'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 7 AND name = 'День бухгалтера в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День сыновей'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День психолога в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день акварели'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День матери в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День работника свеклосахарной отрасли России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День моржа в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День российского военного миротворца'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День гармониста в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Международный день борьбы за ликвидацию насилия в отношении женщин'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день информации'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день сапожника'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День морской пехоты России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День самозанятых в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День оценщика в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день сострадания'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Черная пятница'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день солидарности с палестинским народом'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Всемирный день отказа от покупок'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день домашних животных'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день защиты информации'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День памяти всех жертв применения химического оружия'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день борьбы со СПИДом'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день борьбы со СПИДом'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Всероссийский день хоккея'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День Пермского края'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'День победы русской эскадры над турецкой эскадрой у мыса Синоп'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'День сетевика в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 6 AND name = 'День невролога'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День банковского работника России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День 2D-художников'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Киберпонедельник'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Международный день борьбы за отмену рабства'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день инвалидов'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день инвалидов'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День Неизвестного Солдата в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День юриста в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Всемирный день компьютерной графики'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'Международный день борьбы с пестицидами'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День заказов подарков и написания писем Деду Морозу'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Праздник Введения во храм Пресвятой Богородицы'), 
       (SELECT id FROM holiday_categories WHERE name = 'Православные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Международный день банков'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'День информатики в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'День Марены'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники славян'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День онлайн-предпринимателя'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День начала контрнаступления советских войск под Москвой'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День добровольца (волонтера) в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Международный день добровольцев'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 5 AND name = 'Всемирный день почв'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 6 AND name = 'День ниндзя'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День образования подразделений по контролю за оборотом наркотиков системы МВД России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День памяти великого князя Александра Невского'), 
       (SELECT id FROM holiday_categories WHERE name = 'Православные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день гражданской авиации'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День инженерно-авиационной службы ВКС России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день художника'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День образования российского казначейства'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День Героев Отечества в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День создания ведомственной охраны железнодорожного транспорта России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Международный день борьбы с коррупцией'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Международный день памяти жертв преступления геноцида, чествования их достоинства и предупреждения этого преступления'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День прав человека'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день прав животных'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День создания службы связи МВД России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день гор'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день танго'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День Конституции Российской Федерации'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День пряничного домика'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Международный день всеобщего охвата услугами здравоохранения'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Международный день нейтралитета'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День медведя'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День святого апостола Андрея Первозванного'), 
       (SELECT id FROM holiday_categories WHERE name = 'Православные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День башкирского языка'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Наумов день'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники славян'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Международный день обезьян'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День чая'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День образования Радиотехнических войск ВКС России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День покорения вершин'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День Ракетных войск стратегического назначения Вооруженных Сил России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День образования Российской фельдъегерской связи'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День курьера в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Международный день защиты секс-работников от насилия и жестокости'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день мигранта'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День подразделений собственной безопасности органов внутренних дел России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День работников органов ЗАГСа в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'День арабского языка в ООН'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День военной контрразведки в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День снабженца в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'Международный день помощи бедным'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День работника органов безопасности Российской Федерации'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день солидарности людей'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День неудачника'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Всемирный день баскетбола'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День зимнего солнцестояния'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День риэлтора в России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'Карачун (Корочун)'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники славян'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День энергетика'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День энергетика'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день бардовской песни'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 3 AND name = 'День Гидрометеорологической службы Вооружённых сил России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 4 AND name = 'День образования Пенсионного фонда России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День дальней авиации ВКС России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День взятия турецкой крепости Измаил русскими войсками'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Рождество по Новоюлианскому календарю'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Коляда'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники славян'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День подарков'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'День войск ПВО Сухопутных войск России'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День спасателя Российской Федерации'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 2 AND name = 'Международный день противоэпидемической готовности'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники ООН'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день кино'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'Международный день виолончели'), 
       (SELECT id FROM holiday_categories WHERE name = 'Международные праздники'))
ON CONFLICT DO NOTHING;

INSERT INTO holiday_category_links (holiday_id, category_id)
VALUES ((SELECT id FROM holidays WHERE order_number = 1 AND name = 'День страны, которой нет'), 
       (SELECT id FROM holiday_categories WHERE name = 'Праздники России'))
ON CONFLICT DO NOTHING;
COMMIT;
